[
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Ziqi Wang",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T21:34:18+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-01-26-my-first-post/",
    "title": "My first post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Ziqi Wang",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-26-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-26T23:44:52+08:00",
    "input_file": "my-first-post.utf8.md"
  },
  {
    "path": "posts/2021-01-27-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Ziqi Wang",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-27",
    "categories": [],
    "contents": "\r\nISSS608 Visual Analytics and Applications - DataViz Makeover 1\r\nZiqi Wang (ziqiwang.2020@mitb.smu.edu.sg)\r\nData Visualization Link (Tableau Online):\r\nhttps://public.tableau.com/profile/ziqi.wang7044#!/vizhome/Makeover1_16114043960890/LFPR?publish=yes\r\n1. Critiques and Suggestions for Current Visualization \r\n1.1 Clarity\r\na. The title of the chart does not well convey the purpose of this visualization, it could be more informative if the title includes the specific aspect that the chart reflects.\r\nSuggestion: In fact, the chart shows the percentage of labor force of each age group account for, therefore, the title can be modified to “Proportion of Resident Labor Force by Age”.\r\nb. The aim of this visualization is to reflect the movement of labor force age cohort. In this case, the population is mainly grouped into “labor force aged 25 to 54” and “labor force aged 55 & over”. However, this two groups cannot be obviously differentiated. Additionally, the cumulative proportion of this two age groups cannot be acquired directly from the chart.\r\nSuggestion: Therefore it’s bse dividing line or different colors to depict the two main age groups. Add labels for the cumulative proportion for each group.\r\nc. As the major insight of this visualization is that the median age of labor force rose from 41 to 44. The reference lines indicate the median age of each year and are distinguished by color correspondingly, which facilitate easy comparison and observation.\r\nSuggestion: Keep it this way.\r\nd. The chart skips the y-axis by putting the percentage of each age group below, to directly perceive the data, presenting numbers in form of visualization would be more useful for readers to gauge the statistical level. Moreover, these values provided in chart are not solely based on or derived from the suggested data source — Table 5: RESIDENT LABOUR FORCE PARTICIPATION RATE BY AGE AND SEX, 2009 – 2019 (JUNE).\r\nSuggestion: This visualization needs to reflect the amount of data as well as the trend of the data, therefore it can be improved by using a combination of histogram and line chart.\r\ne. The note at the bottom indicates the rounding issue, which is good. However, the use of the words “may not” is not statistically precise.\r\nSuggestion: The content of the note can be changed to “The figures are rounding to one decimal place”.\r\n1.2 Aesthetics\r\na. Overall the use of font, font size, and font color are clear, and the layout is well-structured.\r\nSuggestion: Keep it this way.\r\nb. The colors used to represent two different years seems close, which can be improved to highlight.\r\nSuggestion: Use colors with higher degree of contrast.\r\nc. The Source is at the bottom center while the Note is at the bottom left, which seems not neat.\r\nSuggestion: Align the Source with Note at the bottom left.\r\n2. Proposed Design of Alternative Data Visualization\r\n3. Data Visualization Steps\r\nData Preparation\r\n1. Delete the entire empty row in the raw data (mrsd_2019LabourForce_T5.xlsx), to avoid the null values in further steps.\r\n\r\n2. Import raw data to Tableau and select T5_T table.\r\n3.Due to the format of raw data, after Dragging the excel file (mrsd_2019LabourForce_T5.xlsx) into Tableau, we can see that the imported data contains many null values as well as a lot of other information. To tidy up the dataset, we check the box in front of “Use Data Interpreter”. Then it will automatically exclude the unrelated data.\r\n\r\nSince the first column still contains null values and texts, thus we hide the entire column. \r\n4. Press the Ctrl key to select all column except “Age (Years)1”, then create pivot table by right clicking.\r\n\r\nChange the column names accordingly.\r\n\r\nTableau Works\r\n1. Create the “Labor Participation Rate” calculation field to change the data format of “Participation Rate” into percentage.\r\n\r\n2. Create the “Rank” calculation field by right clicking the empty filed of “Data”.\r\n\r\n3. Drag “Labor Participation Rate” into “Columns”, and “Rank” into “Rows”. Set “Rank” as discrete.\r\n\r\n4. Put “Age Group” into Marks – Label.\r\n\r\n5. Select “Edit Table Calculation” by right clicking “Rank”, then select “Specific Dimensions” in the pop-up window.\r\n\r\n6. Drag “Year” into “Pages” and change the property into Year. Edit title accordingly. \r\n\r\n7. Put “Age Group”, “Rank”, and “YEAR(Year)” to Filters, so that we can edit filters according to our focus.\r\n\r\n8. Edit color of “Age Group”, use darker color for elder group. \r\n9. Create lollipop chart, firstly Drag “Labor Participation Rate” into “Columns”.\r\n\r\n10.Right click the x-axis on the right side and select “Dual Axis”\r\n\r\n11. Mark one “Labor Participation Rate” as Bar and another as “Circle”. \r\n12. Right clicking the x-axis and select “Synchronize Axis”\r\n\r\n13. Adjust the position, size and color of labels to fit the view.\r\n14. Add reference line by right clicking the x-axis to show the average participation rate. \r\n15. Add caption to indicate the data source.\r\n4. Final Visualization Output \r\n5. Major Insights\r\na. While selecting the year from 2009 to 2019, we can observe that the reference line shifts to the right gradually, which means the average labor force participation rate increased over the year, from 62.73% to 67.97%.\r\nb. We use the light blue represents the young labor force (aged from 15-24), the azure represents the meddle-aged labor force (aged from 25-54), and the dark blue for the elder labor force (55 & over). By selecting the year from 2009 to 2019, we can observe that although the labor force participation rate of the elder age cohort increased, the labor force participation rate of middle-aged labor force remained the top, which indicates that middle-aged labor force is the main composition of labor force.\r\nc. Labor force participation rate of 20 - 24 ranked as 8 in 2009, which is surpassed by Labor force participation rate of 55 – 64 and decreased from 63.50% to 61.0%. Based on this, we can infer that the overall age of labor force has increased along the years.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-28T21:40:46+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
